{"page_url": "https://www.gamespot.com/articles/ingress-pokemon-go-predecessor-is-celebrating-its-10th-anniversary-by-making-its-players-see-red/1100-6509136/", "page_title_en": "Ingress Pokemon Gos Predecessor Is Celebrating 10th Anniversary By Making Players See Red", "page_title_ko": "", "page_title_cn": "", "page_description_en": "A senior producer for Ingress talks about the game's first decade, how it shaped Niantic's process, and what's to come.", "page_description_ko": "", "page_description_cn": "", "page_author": "Jason Fanelli", "page_date": "2022-11-15T06:00:00-0800", "page_text_html": "\n                <p dir=\"ltr\">If you've played Pokemon Go, Pikmin Bloom, or any game from Niantic, you've used mechanics and data that came from Ingress, the company's first-ever real-world game. First released when Niantic was part of Google in 2012, Ingress is celebrating its 10th anniversary with a full year's worth of in-game events.</p><p dir=\"ltr\">The anniversary update is highlighted by a massive PvE campaign, which will pit the green Enlightened players against the blue Resistance members over the fate of a third red faction, the first new faction introduced since the game's launch. If the Enlightened win the event, all players will find out the source of the red team's energy, but if the Resistance wins, the door to the other side of the portals will remain shut.</p><figure data-embed-type=\"gallery\" data-img-src=\"https://www.gamespot.com/a/uploads/original/3/37852/4062956-ing_10-year-infographic_ig-1.jpeg,https://www.gamespot.com/a/uploads/original/3/37852/4062957-ing_10-year-infographic_ig-2.jpeg,https://www.gamespot.com/a/uploads/original/3/37852/4062958-ing_10-year-infographic_ig-3.jpeg,https://www.gamespot.com/a/uploads/original/3/37852/4062959-ing_10-year-infographic_ig-4.jpeg,https://www.gamespot.com/a/uploads/original/3/37852/4062960-ing_10-year-infographic_ig-5.jpeg,https://www.gamespot.com/a/uploads/original/3/37852/4062961-ing_10-year-infographic_ig-6.jpeg,https://www.gamespot.com/a/uploads/original/3/37852/4062962-ing_10-year-infographic_tw-1.jpeg,https://www.gamespot.com/a/uploads/original/3/37852/4062963-ing_10-year-infographic_tw-2.jpeg,https://www.gamespot.com/a/uploads/original/3/37852/4062964-ing_10-year-infographic_tw-3.jpeg,https://www.gamespot.com/a/uploads/original/3/37852/4062965-ingress_10year_infographic_red2.png\" data-ref-id=\"1300-4062956,1300-4062957,1300-4062958,1300-4062959,1300-4062960,1300-4062961,1300-4062962,1300-4062963,1300-4062964,1300-4062965\" data-resize-urls=\"https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062956-ing_10-year-infographic_ig-1.jpeg,https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062957-ing_10-year-infographic_ig-2.jpeg,https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062958-ing_10-year-infographic_ig-3.jpeg,https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062959-ing_10-year-infographic_ig-4.jpeg,https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062960-ing_10-year-infographic_ig-5.jpeg,https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062961-ing_10-year-infographic_ig-6.jpeg,https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062962-ing_10-year-infographic_tw-1.jpeg,https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062963-ing_10-year-infographic_tw-2.jpeg,https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062964-ing_10-year-infographic_tw-3.jpeg,https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062965-ingress_10year_infographic_red2.png\"><div class=\"image-gallery__label\">Gallery</div>   <div class=\"image-gallery__list hide-scrollbar\">       <a href=\"https://www.gamespot.com/a/uploads/original/3/37852/4062956-ing_10-year-infographic_ig-1.jpeg\" data-ref-id=\"1300-4062956\">       <img src=\"https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062956-ing_10-year-infographic_ig-1.jpeg\" alt=\"Gallery image 1\" data-full-srcset=\"https://www.gamespot.com/a/uploads/original/3/37852/4062956-ing_10-year-infographic_ig-1.jpeg 1080w, https://www.gamespot.com/a/uploads/scale_medium/3/37852/4062956-ing_10-year-infographic_ig-1.jpeg 960w\">     </a>       <a href=\"https://www.gamespot.com/a/uploads/original/3/37852/4062957-ing_10-year-infographic_ig-2.jpeg\" data-ref-id=\"1300-4062957\">       <img src=\"https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062957-ing_10-year-infographic_ig-2.jpeg\" alt=\"Gallery image 2\" data-full-srcset=\"https://www.gamespot.com/a/uploads/original/3/37852/4062957-ing_10-year-infographic_ig-2.jpeg 1080w, https://www.gamespot.com/a/uploads/scale_medium/3/37852/4062957-ing_10-year-infographic_ig-2.jpeg 960w\">     </a>       <a href=\"https://www.gamespot.com/a/uploads/original/3/37852/4062958-ing_10-year-infographic_ig-3.jpeg\" data-ref-id=\"1300-4062958\">       <img src=\"https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062958-ing_10-year-infographic_ig-3.jpeg\" alt=\"Gallery image 3\" data-full-srcset=\"https://www.gamespot.com/a/uploads/original/3/37852/4062958-ing_10-year-infographic_ig-3.jpeg 1080w, https://www.gamespot.com/a/uploads/scale_medium/3/37852/4062958-ing_10-year-infographic_ig-3.jpeg 960w\">     </a>       <a href=\"https://www.gamespot.com/a/uploads/original/3/37852/4062959-ing_10-year-infographic_ig-4.jpeg\" data-ref-id=\"1300-4062959\">       <img src=\"https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062959-ing_10-year-infographic_ig-4.jpeg\" alt=\"Gallery image 4\" data-full-srcset=\"https://www.gamespot.com/a/uploads/original/3/37852/4062959-ing_10-year-infographic_ig-4.jpeg 1080w, https://www.gamespot.com/a/uploads/scale_medium/3/37852/4062959-ing_10-year-infographic_ig-4.jpeg 960w\">     </a>       <a href=\"https://www.gamespot.com/a/uploads/original/3/37852/4062960-ing_10-year-infographic_ig-5.jpeg\" data-ref-id=\"1300-4062960\">       <img src=\"https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062960-ing_10-year-infographic_ig-5.jpeg\" alt=\"Gallery image 5\" data-full-srcset=\"https://www.gamespot.com/a/uploads/original/3/37852/4062960-ing_10-year-infographic_ig-5.jpeg 1080w, https://www.gamespot.com/a/uploads/scale_medium/3/37852/4062960-ing_10-year-infographic_ig-5.jpeg 960w\">     </a>       <a href=\"https://www.gamespot.com/a/uploads/original/3/37852/4062961-ing_10-year-infographic_ig-6.jpeg\" data-ref-id=\"1300-4062961\">       <img src=\"https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062961-ing_10-year-infographic_ig-6.jpeg\" alt=\"Gallery image 6\" data-full-srcset=\"https://www.gamespot.com/a/uploads/original/3/37852/4062961-ing_10-year-infographic_ig-6.jpeg 1080w, https://www.gamespot.com/a/uploads/scale_medium/3/37852/4062961-ing_10-year-infographic_ig-6.jpeg 960w\">     </a>       <a href=\"https://www.gamespot.com/a/uploads/original/3/37852/4062962-ing_10-year-infographic_tw-1.jpeg\" data-ref-id=\"1300-4062962\">       <img src=\"https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062962-ing_10-year-infographic_tw-1.jpeg\" alt=\"Gallery image 7\" data-full-srcset=\"https://www.gamespot.com/a/uploads/original/3/37852/4062962-ing_10-year-infographic_tw-1.jpeg 1920w, https://www.gamespot.com/a/uploads/scale_super/3/37852/4062962-ing_10-year-infographic_tw-1.jpeg 1280w, https://www.gamespot.com/a/uploads/scale_medium/3/37852/4062962-ing_10-year-infographic_tw-1.jpeg 480w\">     </a>       <a href=\"https://www.gamespot.com/a/uploads/original/3/37852/4062963-ing_10-year-infographic_tw-2.jpeg\" data-ref-id=\"1300-4062963\">       <img src=\"https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062963-ing_10-year-infographic_tw-2.jpeg\" alt=\"Gallery image 8\" data-full-srcset=\"https://www.gamespot.com/a/uploads/original/3/37852/4062963-ing_10-year-infographic_tw-2.jpeg 1920w, https://www.gamespot.com/a/uploads/scale_super/3/37852/4062963-ing_10-year-infographic_tw-2.jpeg 1280w, https://www.gamespot.com/a/uploads/scale_medium/3/37852/4062963-ing_10-year-infographic_tw-2.jpeg 480w\">     </a>       <a href=\"https://www.gamespot.com/a/uploads/original/3/37852/4062964-ing_10-year-infographic_tw-3.jpeg\" data-ref-id=\"1300-4062964\">       <img src=\"https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062964-ing_10-year-infographic_tw-3.jpeg\" alt=\"Gallery image 9\" data-full-srcset=\"https://www.gamespot.com/a/uploads/original/3/37852/4062964-ing_10-year-infographic_tw-3.jpeg 1920w, https://www.gamespot.com/a/uploads/scale_super/3/37852/4062964-ing_10-year-infographic_tw-3.jpeg 1280w, https://www.gamespot.com/a/uploads/scale_medium/3/37852/4062964-ing_10-year-infographic_tw-3.jpeg 480w\">     </a>       <a href=\"https://www.gamespot.com/a/uploads/original/3/37852/4062965-ingress_10year_infographic_red2.png\" data-ref-id=\"1300-4062965\">       <img src=\"https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062965-ingress_10year_infographic_red2.png\" alt=\"Gallery image 10\" data-full-srcset=\"https://www.gamespot.com/a/uploads/original/3/37852/4062965-ingress_10year_infographic_red2.png 1350w, https://www.gamespot.com/a/uploads/scale_super/3/37852/4062965-ingress_10year_infographic_red2.png 987w, https://www.gamespot.com/a/uploads/scale_medium/3/37852/4062965-ingress_10year_infographic_red2.png 740w\">     </a>   </div>  </figure><p dir=\"ltr\">To get more information about Ingress's 10-year celebration, we spoke to Niantic senior producer Brian Rose, who kicked off the project while Niantic was part of Google, stayed with Google when Niantic separated and became its own entity, and then in 2019 rejoined the Ingress team by accepting the senior producer role for the game with the new Niantic.</p><p dir=\"ltr\">Rose talks about the beginnings of the Ingress project, including the unique challenges facing a title with such lofty ambitions as Ingress--needing players to provide points of interest, the stigma around mobile games at the time, and more.</p><p dir=\"ltr\">Rose also details what Ingress will be doing in-game to celebrate the 10th anniversary milestone, including some major changes that will make players see red--specifically, a new red faction that will make itself known very quickly into the festivities. It marks the first time a new faction has been introduced in the history of the game.</p><p dir=\"ltr\">This interview was transcribed from a video interview and edited for clarity.</p><p dir=\"ltr\"><strong>The mobile landscape has changed a lot in the 10 years since Ingress launched. During the planning stages when the team was first coming up with the ideas for what would become Ingress, what were some immediate challenges you faced?</strong></p><p dir=\"ltr\">Back then, a lot of the inspiration came from alternate reality gaming. Not so much the \"augmented reality\" format, but more in the vein of <a href=\"https://en.wikipedia.org/wiki/I_Love_Bees\" data-target=\"true\" target=\"_blank\" rel=\"noopener nofollow\">I Love Bees</a>, or in San Francisco they had something called The Jejune Institute. The idea for us was giving people that kind of experience--the world isn't what it seems, the world is actually a game--but then allow people to play that in any place at any time.</p><p dir=\"ltr\">One of the main issues with those alternate reality games was, while they were really cool, they only worked in specific places like San Diego Comic Con or the financial district in San Francisco. With Ingress it was, \"Can we turn the entire world into a game board,\" or since we were a part of Google at the time, \"Can we turn Google Earth into a video game?\" From day one, it was about building a platform where we'll need our players' help to find all of these points of interest for \"portals\" in the game. We didn't have something like Pokemon Go where we could say \"you know Pokemon Go? A real-world game is that.\" Trying to explain to people about a city-based, capture-the-flag, scavenger-type game was challenging back then, before people had this mental model of \"oh it's a game you play outside and it uses all the sensors in your smartphone.\"</p><p dir=\"ltr\"><strong>I can think of two major obstacles: One, it was a cell phone title, and even back then there was a stigma about mobile titles; and two, you're telling gamers to get up and move around to play, which is not always successful. Where did you think the right strategy was in order to say, \"Hey, this is different, and it will require some effort on your end, but trust us, it's worth it?\"</strong></p><p dir=\"ltr\">When I was with Niantic the first time, my title was assistant principal--not like at school--but what I was really doing was a community manager's job. I had to figure out how we grow these global communities, and the strategy at the time was less about grabbing the \"hardcore gamer\" and more towards geocachers or people who are new in town, looking for new friends, and interested in tech. A lot of the success we were having was from people who probably didn't consider themselves gamers, but people who liked the idea of us taking your walk to work or the times you take your dog out just a little more special or creepy or weird by layering this secret agent game on top of the real world. It grew from that point to focusing on that player community, but not necessarily the gamer community.</p><p dir=\"ltr\">We have a lot of players that would say, \"Yeah, I'm not a gamer\" but they were playing 40 hours of Ingress, that's pretty hardcore. One of my favorite stories from back then was from closed beta, we hadn't even launched on iOS yet, and this kid came up and said, \"Brian, I'm so excited, I convinced my mom to let me get my first tattoo, and here it is, it's the Ingress logo!\" He had the Ingress logo on his wrist… and then I had to tell him, \"Hey, we're about to exit closed beta and launch on iPhone, and when we do the logo is changing.\" All the blood just rushed out of his face, so I had to say, \"I have old tattoos too, it's vintage!\" At that moment the realization of, \"Oh, that's what a tattoo means\" sunk in for that kid.</p><p dir=\"ltr\">He was just the first; we started seeing more and more people getting Ingress tattoos, to the point where we had people at Google asking us \"why are people getting Ingress tattoos? We don't see people getting Google Plus or Chrome tattoos, so what's so special about this community that people feel that committed to it? It had a lot to do with focusing on that community and featuring members in the game, where they'd become \"Ingress famous.\" Hopefully that player with the first tattoo didn't instantly regret it.</p><p dir=\"ltr\"><strong>You mentioned that prior to Ingress, AR games only worked in certain locations, while Ingress uses real-world points of interest. In the early going, how did you choose what those locations would be? Were they just notable landmarks? Did you start in San Francisco and then slowly branch out to other cities? Furthermore, how did you research which locations you were using?</strong></p><p dir=\"ltr\">There was an initial set of locations to show people what we were looking for before we started crowdsourcing and opening things up to players at their own locations. The first set was made from a historical landmark database, including USPS post offices. Also, at the time Google had a photo service called Panoramio, which was basically a geotagged Flickr for putting user-generated pictures onto Google Maps. We would pull data from there for photos tagged \"sculpture,\" \"mural,\" \"water fountain,\" or other artistic places. These were interesting places to look at in a neighborhood, but they were also, by nature of being public, likely safe places for people to come and gather.</p><p dir=\"ltr\">We then quickly opened up to the player base to let us know which places should be designated. I don't know every city, but the players in those cities do. They know the hidden gems in that area, so if they want to be able to play the game in those locations, there was a tool in the app that let players take a photo, geotag it, add a description, and then it would get added to the game. That's how we grew into the tens of millions of points-of-interest we had.</p><p dir=\"ltr\">Fast-forward four years, and all of the PokeStops and Gyms found in Pokemon Go initially came from Ingress players.</p><p dir=\"ltr\"><strong>A perfect segue into my next question: Some players may not realize just how much Ingress connects to the other Niantic games. How essential was Ingress in laying the groundwork for future projects?</strong></p><p dir=\"ltr\">There's a few different things Niantic was doing with Ingress data. First, we were looking at where our players moved around in the world; foot paths, sidewalks, etc. to understand the specific movement or traffic patterns of people just walking. This data told us which places are safe, and where people have gone before; we call it our heat map. In Ingress, there's an energy resource in the game called XM, or Exotic Matter; the energy is populated where players have walked around. In Pokemon Go, if you look at where Pokemon spawn in the world, that uses the same sort of data. The same works for points of interest: The areas designated as portals that players had scouted, those areas became PokeStops and Gyms in Pokemon Go.</p><p dir=\"ltr\">The Ingress team, because it's Niantic's own IP, can be a bit more experimental in trying new things. We can see what works and what doesn't, and then graduate what does work into other titles like Pokemon Go. Things like our Ingress Portal Fracker--a consumable boost you deploy at an Ingress Portal where you'll get double the item rewards--became Incense and Lures. We're able to pilot ideas in Ingress first, and then share the lessons we've learned as a team with the other producers. It's not just where Pokemon spawn or where PokeStops are; Ingress also laid the foundation for some game mechanics.</p><p dir=\"ltr\"><strong>How do you keep Ingress unique amongst the growing portfolio of Niantic games?</strong></p><p dir=\"ltr\">It's something I think about a lot: We have a portfolio of different games, but the thing that makes Ingress unique is the team vs. team dynamic. We're not playing against NPCs, we're really playing against another global team. That competition is heightened at our live events, or during our seasonal Live Ops, but it's that feeling where you're not playing against an AI, you're playing against another human, and in Ingress we amplify that competition by broadcasting things players are doing to nearby players. If you have a rival in the game, you can zero in on that player. You can think, \"I do care about my team, but this week I want to basically compete with that one player. How can I do that with stats, or building bigger fields, so that I can help the team but also stick it to my rival?\"</p><p dir=\"ltr\"><strong>Four years ago, Ingress went through a major change, becoming Ingress Prime. What were the major changes that came with that milestone, for those unaware?</strong></p><p dir=\"ltr\">The biggest milestone was behind the scenes, where we changed from native code over to Unity. We did this primarily because all of Niantic's other games are on the platform, so now instead of just sharing ideas, we could potentially just share code or infrastructure across different titles. The change to Unity also allowed our art teams to start experimenting as well, so the client became much more visually complex and appealing. While I did like the old-school Tron vibes of Ingress 1.0, as time goes on there are better devices on the market, meaning people have more powerful devices, so the idea was taking advantage of better GPUs and FPS for improved visuals.</p><p dir=\"ltr\"><strong>How did that new technology allow the Ingress team to improve overall player experience?</strong></p><p dir=\"ltr\">The move to Ingress Prime also allowed us to look at the user interface. There are issues that arise that our players run into multiple times a day, they're simply a pain point like inventory management. With Ingress Prime, since our art and UX team could now jump in and make changes themselves, we started being more experimental with quality-of-life improvements.</p><p dir=\"ltr\">The advancements in phones also came with a slight philosophy change: Ingress 1.0 was focusing on scouting as many geotagged locations as possible. We built a 2D map that showed us where people want to play Niantic real-world games. Now with Prime, one of the first features I built when I returned to the team was AR mapping, or the idea of portal scanning with more modern hardware. We wanted to take that 2D map and try to recreate it in 3D, as we were figuring out rich and immersive outdoor gameplay, but it's also a \"chicken and egg\" problem: Instead of just putting a virtual object into a scene, since this is a secret agent game, could we place the dead drop under a bench, or have a player reach around a statue to find the item? There are things we really want to do that we need that 3D map for, so we want to build the map first, and then simultaneously work on designing those features.</p><p dir=\"ltr\">I also firmly believe that AR wearables, like AR glasses, are going to be the next wave of computing. Phones are still going to be around, but wouldn't it be fun to walk around outside and see Ingress portals or other Niantic waypoints right in front of you instead of just staring at a small screen? It's going to take time--those wearables aren't out yet and it takes times to make a game--but we're thinking about those ideas now so we're ready when those things come along.</p><p dir=\"ltr\"><strong>Speaking of using an entire space, did Ingress have the same issues with trespassing that Pokemon Go had when it first launched? Were people searching for Ingress portals in areas that resulted in legal--or worse--consequences?</strong></p><p dir=\"ltr\">There were issues that happened with Pokemon Go simply because of how popular it was. A group of dozens of people walking down a street is going to attract attention. There's a difference in scale to be sure, but another part of it is the game's backstory: It's a secret agent world, and as a secret agent you're meant to be a bit more clandestine or subtle with your actions. A lot of the player means we've had since launch is not knowing if someone else at a location is playing Ingress or scrolling through social media. Tasks are meant to be done quickly, a few quick swipes and move on, so you never know who's playing and who isn't. That's what brings people together; you're in on this shared secret that the world is really about global control of exotic matter.</p><p dir=\"ltr\"><strong>How would you say, even with the growth in Niantic's portfolio, Ingress has maintained its popularity? Have players who started with Pokemon Go moved into Ingress? Also, how would you present Ingress to a player of another Niantic game?</strong></p><p dir=\"ltr\">There aren't too many titles that have lasted 10 years as a continuous live service, and I think that longevity really speaks to the player community. We have events called First Saturdays, where the first Saturday of every month was designed to bring new players into the fold. If you don't know what to do, you could attend one of these events and get introduced to the social side of the game. Players would play together, gain experience, and then go out for drinks or dinner afterward.</p><p dir=\"ltr\">When the pandemic happened, everything moved indoors, but people continued to play the same way. People wanted to check in on each other, so when they wouldn't see someone's name in the in-game chat for a while, they'd reach out and ask if everything was okay. Players really were there for other players, and I think that comes from the team-based gameplay. I don't have a military background, but the way I'd describe it is a \"no person left behind\" idea that runs through the community.</p><p dir=\"ltr\">For new players coming in, one of the most effective ways I've seen people come into Ingress from Pokemon Go or another title is through those First Saturdays and connecting with the player community. With Pokemon Go you know what you're supposed to be doing, you gotta catch 'em all. With Ingress, maybe you watched the Netflix anime, or you liked another Niantic game and wanted to try another. As an original IP we don't have that one-line slogan that Pokemon Go has, so players may not know exactly what they're getting into, but those events definitely help.</p><p dir=\"ltr\"><strong>How will Ingress be celebrating the 10th anniversary milestone? What events does the game have planned?</strong></p><p dir=\"ltr\">Every year we do an annual Live Operation to celebrate the birthday, featuring boosted rewards, double AP, etc. We do see a ton of heightened activity during that time, thanks to the increased rewards. We also have an achievement medal that players earn based on their level in the game; if you're at max level, you get the best medal.</p><p dir=\"ltr\">This year we went back to a question we ask ourselves all the time: What can we do or build that the players will ask us for? The thing we came back to over and over again was live events: before COVID we would have quarterly live events, but we had to take a pause on these large-scale live events due to the pandemic. We've been trying to figure out how to return to these live events once the world is ready to open back up again, and this quarter that's what we're seeing. Japan, for example, has a huge player base and they just re-opened, and because this is a global game we set the same rules for every region. In this quarter we have our finale for the year, and we've decided we're going back to large-scale Anomaly events.</p><p dir=\"ltr\">However, unlike previous years where our anniversary event was a short, punctuated celebration, this year we're thinking about it as celebrating the 10th anniversary all year long. This is the 10th anniversary, but there's things coming all year long. The biggest surprise for our players is going to change the game ever since we've launched we've had two teams: the green team called the Enlightened, and the blue team called the Resistance. Players asked us for years about a red team, and the Ingress anime introduces the idea of a dark Ingress faction that comes from the other side of the portal, and that's what we're launching for year 10.</p><p dir=\"ltr\">Players get intertwined into the story, and these live events help advance the story. If the Enlightened win, players will figure out what's on the other side of the portal, and if the Resistance wins, they don't want to open Pandora's Box, so they're going to close that door and move onto the next quarterly season. No matter which team wins, after the Los Angeles live event we'll turn on a new unknown entity in the game that they'll find out about for the next year. Players will try to figure out how they can use this new red faction against the other team.</p><p dir=\"ltr\">We're also focusing on new players in this update, focusing on a task-based system that allows new players to level up easily and hold their hands until they link to a new player community. From there, the community can take them under their wing, teach them the ropes, and show them what the game has to offer.</p><div data-embed-type=\"imageGallery\" data-ref-id=\"3912\"><div class=\"image-gallery__header\">The 26 Best Mobile Games Available For iOS And Android</div><div class=\"image-gallery__main\"><div class=\"image-gallery__item\"><img src=\"https://www.gamespot.com/a/uploads/screen_medium/1601/16018044/3932024-wtg.jpg\"></div><div class=\"image-gallery__item\"><img src=\"https://www.gamespot.com/a/uploads/screen_medium/1601/16018044/3932021-3882969-amongus.jpg\"></div><div class=\"image-gallery__item\"><img src=\"https://www.gamespot.com/a/uploads/screen_medium/1601/16018044/3932020-3882970-civilization_vi_keyart.jpg\"></div><div class=\"image-gallery__item\"><img src=\"https://www.gamespot.com/a/uploads/screen_medium/1601/16018044/3932018-3882971-device6.jpg\"></div><div class=\"image-gallery__item\"><img src=\"https://www.gamespot.com/a/uploads/screen_petite/1601/16018044/3932017-3882972-downwell.jpg\"></div><div class=\"image-gallery__item\"><img src=\"https://www.gamespot.com/a/uploads/screen_petite/1601/16018044/3932016-3882973-flronceheader.jpg\"></div><div class=\"image-gallery__item\"><img src=\"https://www.gamespot.com/a/uploads/screen_petite/1601/16018044/3932015-3882974-hitmango.jpg\"></div><div class=\"image-gallery__item image-gallery__item--show-more\"><a class=\"js-click-tag\" data-click-tag=\"image gallery|see more\" href=\"/gallery/the-26-best-mobile-games-available-for-ios-and-android/2900-3912/\">See More</a></div></div></div>\n  \n                        \n    \n        <div class=\"js-mapped-ad mapped-ad mapped-mpu_middle mapped-mpu_middle-dart js-seamless-middle-mpu float-right no-inner-space\" data-ad-type=\"mpu_middle\"><div class=\"ad-wrap ad-wrap-mpu_middle\"></div></div>\n        <div class=\"js-mapped-ad mapped-ad mapped-mpu_bottom mapped-mpu_bottom-dart js-seamless-bottom-mpu float-right no-inner-space\" data-ad-type=\"mpu_bottom\"><div class=\"ad-wrap ad-wrap-mpu_bottom\"></div></div>\n  \n                        <div class=\"js-inline-widget\" id=\"inline-bottom\"></div>          ", "page_text_en": "If you've played Pokemon Go, Pikmin Bloom, or any game from Niantic, you've used mechanics and data that came from Ingress, the company's first-ever real-world game. First released when Niantic was part of Google in 2012, Ingress is celebrating its 10th anniversary with a full year's worth of in-game events.\n\nThe anniversary update is highlighted by a massive PvE campaign, which will pit the green Enlightened players against the blue Resistance members over the fate of a third red faction, the first new faction introduced since the game's launch. If the Enlightened win the event, all players will find out the source of the red team's energy, but if the Resistance wins, the door to the other side of the portals will remain shut.\n\nGallery\n\nTo get more information about Ingress's 10-year celebration, we spoke to Niantic senior producer Brian Rose, who kicked off the project while Niantic was part of Google, stayed with Google when Niantic separated and became its own entity, and then in 2019 rejoined the Ingress team by accepting the senior producer role for the game with the new Niantic.\n\nRose talks about the beginnings of the Ingress project, including the unique challenges facing a title with such lofty ambitions as Ingress--needing players to provide points of interest, the stigma around mobile games at the time, and more.\n\nRose also details what Ingress will be doing in-game to celebrate the 10th anniversary milestone, including some major changes that will make players see red--specifically, a new red faction that will make itself known very quickly into the festivities. It marks the first time a new faction has been introduced in the history of the game.\n\nThis interview was transcribed from a video interview and edited for clarity.\n\nThe mobile landscape has changed a lot in the 10 years since Ingress launched. During the planning stages when the team was first coming up with the ideas for what would become Ingress, what were some immediate challenges you faced?\n\nBack then, a lot of the inspiration came from alternate reality gaming. Not so much the \"augmented reality\" format, but more in the vein of I Love Bees, or in San Francisco they had something called The Jejune Institute. The idea for us was giving people that kind of experience--the world isn't what it seems, the world is actually a game--but then allow people to play that in any place at any time.\n\nOne of the main issues with those alternate reality games was, while they were really cool, they only worked in specific places like San Diego Comic Con or the financial district in San Francisco. With Ingress it was, \"Can we turn the entire world into a game board,\" or since we were a part of Google at the time, \"Can we turn Google Earth into a video game?\" From day one, it was about building a platform where we'll need our players' help to find all of these points of interest for \"portals\" in the game. We didn't have something like Pokemon Go where we could say \"you know Pokemon Go? A real-world game is that.\" Trying to explain to people about a city-based, capture-the-flag, scavenger-type game was challenging back then, before people had this mental model of \"oh it's a game you play outside and it uses all the sensors in your smartphone.\"\n\nI can think of two major obstacles: One, it was a cell phone title, and even back then there was a stigma about mobile titles; and two, you're telling gamers to get up and move around to play, which is not always successful. Where did you think the right strategy was in order to say, \"Hey, this is different, and it will require some effort on your end, but trust us, it's worth it?\"\n\nWhen I was with Niantic the first time, my title was assistant principal--not like at school--but what I was really doing was a community manager's job. I had to figure out how we grow these global communities, and the strategy at the time was less about grabbing the \"hardcore gamer\" and more towards geocachers or people who are new in town, looking for new friends, and interested in tech. A lot of the success we were having was from people who probably didn't consider themselves gamers, but people who liked the idea of us taking your walk to work or the times you take your dog out just a little more special or creepy or weird by layering this secret agent game on top of the real world. It grew from that point to focusing on that player community, but not necessarily the gamer community.\n\nWe have a lot of players that would say, \"Yeah, I'm not a gamer\" but they were playing 40 hours of Ingress, that's pretty hardcore. One of my favorite stories from back then was from closed beta, we hadn't even launched on iOS yet, and this kid came up and said, \"Brian, I'm so excited, I convinced my mom to let me get my first tattoo, and here it is, it's the Ingress logo!\" He had the Ingress logo on his wrist… and then I had to tell him, \"Hey, we're about to exit closed beta and launch on iPhone, and when we do the logo is changing.\" All the blood just rushed out of his face, so I had to say, \"I have old tattoos too, it's vintage!\" At that moment the realization of, \"Oh, that's what a tattoo means\" sunk in for that kid.\n\nHe was just the first; we started seeing more and more people getting Ingress tattoos, to the point where we had people at Google asking us \"why are people getting Ingress tattoos? We don't see people getting Google Plus or Chrome tattoos, so what's so special about this community that people feel that committed to it? It had a lot to do with focusing on that community and featuring members in the game, where they'd become \"Ingress famous.\" Hopefully that player with the first tattoo didn't instantly regret it.\n\nYou mentioned that prior to Ingress, AR games only worked in certain locations, while Ingress uses real-world points of interest. In the early going, how did you choose what those locations would be? Were they just notable landmarks? Did you start in San Francisco and then slowly branch out to other cities? Furthermore, how did you research which locations you were using?\n\nThere was an initial set of locations to show people what we were looking for before we started crowdsourcing and opening things up to players at their own locations. The first set was made from a historical landmark database, including USPS post offices. Also, at the time Google had a photo service called Panoramio, which was basically a geotagged Flickr for putting user-generated pictures onto Google Maps. We would pull data from there for photos tagged \"sculpture,\" \"mural,\" \"water fountain,\" or other artistic places. These were interesting places to look at in a neighborhood, but they were also, by nature of being public, likely safe places for people to come and gather.\n\nWe then quickly opened up to the player base to let us know which places should be designated. I don't know every city, but the players in those cities do. They know the hidden gems in that area, so if they want to be able to play the game in those locations, there was a tool in the app that let players take a photo, geotag it, add a description, and then it would get added to the game. That's how we grew into the tens of millions of points-of-interest we had.\n\nFast-forward four years, and all of the PokeStops and Gyms found in Pokemon Go initially came from Ingress players.\n\nA perfect segue into my next question: Some players may not realize just how much Ingress connects to the other Niantic games. How essential was Ingress in laying the groundwork for future projects?\n\nThere's a few different things Niantic was doing with Ingress data. First, we were looking at where our players moved around in the world; foot paths, sidewalks, etc. to understand the specific movement or traffic patterns of people just walking. This data told us which places are safe, and where people have gone before; we call it our heat map. In Ingress, there's an energy resource in the game called XM, or Exotic Matter; the energy is populated where players have walked around. In Pokemon Go, if you look at where Pokemon spawn in the world, that uses the same sort of data. The same works for points of interest: The areas designated as portals that players had scouted, those areas became PokeStops and Gyms in Pokemon Go.\n\nThe Ingress team, because it's Niantic's own IP, can be a bit more experimental in trying new things. We can see what works and what doesn't, and then graduate what does work into other titles like Pokemon Go. Things like our Ingress Portal Fracker--a consumable boost you deploy at an Ingress Portal where you'll get double the item rewards--became Incense and Lures. We're able to pilot ideas in Ingress first, and then share the lessons we've learned as a team with the other producers. It's not just where Pokemon spawn or where PokeStops are; Ingress also laid the foundation for some game mechanics.\n\nHow do you keep Ingress unique amongst the growing portfolio of Niantic games?\n\nIt's something I think about a lot: We have a portfolio of different games, but the thing that makes Ingress unique is the team vs. team dynamic. We're not playing against NPCs, we're really playing against another global team. That competition is heightened at our live events, or during our seasonal Live Ops, but it's that feeling where you're not playing against an AI, you're playing against another human, and in Ingress we amplify that competition by broadcasting things players are doing to nearby players. If you have a rival in the game, you can zero in on that player. You can think, \"I do care about my team, but this week I want to basically compete with that one player. How can I do that with stats, or building bigger fields, so that I can help the team but also stick it to my rival?\"\n\nFour years ago, Ingress went through a major change, becoming Ingress Prime. What were the major changes that came with that milestone, for those unaware?\n\nThe biggest milestone was behind the scenes, where we changed from native code over to Unity. We did this primarily because all of Niantic's other games are on the platform, so now instead of just sharing ideas, we could potentially just share code or infrastructure across different titles. The change to Unity also allowed our art teams to start experimenting as well, so the client became much more visually complex and appealing. While I did like the old-school Tron vibes of Ingress 1.0, as time goes on there are better devices on the market, meaning people have more powerful devices, so the idea was taking advantage of better GPUs and FPS for improved visuals.\n\nHow did that new technology allow the Ingress team to improve overall player experience?\n\nThe move to Ingress Prime also allowed us to look at the user interface. There are issues that arise that our players run into multiple times a day, they're simply a pain point like inventory management. With Ingress Prime, since our art and UX team could now jump in and make changes themselves, we started being more experimental with quality-of-life improvements.\n\nThe advancements in phones also came with a slight philosophy change: Ingress 1.0 was focusing on scouting as many geotagged locations as possible. We built a 2D map that showed us where people want to play Niantic real-world games. Now with Prime, one of the first features I built when I returned to the team was AR mapping, or the idea of portal scanning with more modern hardware. We wanted to take that 2D map and try to recreate it in 3D, as we were figuring out rich and immersive outdoor gameplay, but it's also a \"chicken and egg\" problem: Instead of just putting a virtual object into a scene, since this is a secret agent game, could we place the dead drop under a bench, or have a player reach around a statue to find the item? There are things we really want to do that we need that 3D map for, so we want to build the map first, and then simultaneously work on designing those features.\n\nI also firmly believe that AR wearables, like AR glasses, are going to be the next wave of computing. Phones are still going to be around, but wouldn't it be fun to walk around outside and see Ingress portals or other Niantic waypoints right in front of you instead of just staring at a small screen? It's going to take time--those wearables aren't out yet and it takes times to make a game--but we're thinking about those ideas now so we're ready when those things come along.\n\nSpeaking of using an entire space, did Ingress have the same issues with trespassing that Pokemon Go had when it first launched? Were people searching for Ingress portals in areas that resulted in legal--or worse--consequences?\n\nThere were issues that happened with Pokemon Go simply because of how popular it was. A group of dozens of people walking down a street is going to attract attention. There's a difference in scale to be sure, but another part of it is the game's backstory: It's a secret agent world, and as a secret agent you're meant to be a bit more clandestine or subtle with your actions. A lot of the player means we've had since launch is not knowing if someone else at a location is playing Ingress or scrolling through social media. Tasks are meant to be done quickly, a few quick swipes and move on, so you never know who's playing and who isn't. That's what brings people together; you're in on this shared secret that the world is really about global control of exotic matter.\n\nHow would you say, even with the growth in Niantic's portfolio, Ingress has maintained its popularity? Have players who started with Pokemon Go moved into Ingress? Also, how would you present Ingress to a player of another Niantic game?\n\nThere aren't too many titles that have lasted 10 years as a continuous live service, and I think that longevity really speaks to the player community. We have events called First Saturdays, where the first Saturday of every month was designed to bring new players into the fold. If you don't know what to do, you could attend one of these events and get introduced to the social side of the game. Players would play together, gain experience, and then go out for drinks or dinner afterward.\n\nWhen the pandemic happened, everything moved indoors, but people continued to play the same way. People wanted to check in on each other, so when they wouldn't see someone's name in the in-game chat for a while, they'd reach out and ask if everything was okay. Players really were there for other players, and I think that comes from the team-based gameplay. I don't have a military background, but the way I'd describe it is a \"no person left behind\" idea that runs through the community.\n\nFor new players coming in, one of the most effective ways I've seen people come into Ingress from Pokemon Go or another title is through those First Saturdays and connecting with the player community. With Pokemon Go you know what you're supposed to be doing, you gotta catch 'em all. With Ingress, maybe you watched the Netflix anime, or you liked another Niantic game and wanted to try another. As an original IP we don't have that one-line slogan that Pokemon Go has, so players may not know exactly what they're getting into, but those events definitely help.\n\nHow will Ingress be celebrating the 10th anniversary milestone? What events does the game have planned?\n\nEvery year we do an annual Live Operation to celebrate the birthday, featuring boosted rewards, double AP, etc. We do see a ton of heightened activity during that time, thanks to the increased rewards. We also have an achievement medal that players earn based on their level in the game; if you're at max level, you get the best medal.\n\nThis year we went back to a question we ask ourselves all the time: What can we do or build that the players will ask us for? The thing we came back to over and over again was live events: before COVID we would have quarterly live events, but we had to take a pause on these large-scale live events due to the pandemic. We've been trying to figure out how to return to these live events once the world is ready to open back up again, and this quarter that's what we're seeing. Japan, for example, has a huge player base and they just re-opened, and because this is a global game we set the same rules for every region. In this quarter we have our finale for the year, and we've decided we're going back to large-scale Anomaly events.\n\nHowever, unlike previous years where our anniversary event was a short, punctuated celebration, this year we're thinking about it as celebrating the 10th anniversary all year long. This is the 10th anniversary, but there's things coming all year long. The biggest surprise for our players is going to change the game ever since we've launched we've had two teams: the green team called the Enlightened, and the blue team called the Resistance. Players asked us for years about a red team, and the Ingress anime introduces the idea of a dark Ingress faction that comes from the other side of the portal, and that's what we're launching for year 10.\n\nPlayers get intertwined into the story, and these live events help advance the story. If the Enlightened win, players will figure out what's on the other side of the portal, and if the Resistance wins, they don't want to open Pandora's Box, so they're going to close that door and move onto the next quarterly season. No matter which team wins, after the Los Angeles live event we'll turn on a new unknown entity in the game that they'll find out about for the next year. Players will try to figure out how they can use this new red faction against the other team.\n\nWe're also focusing on new players in this update, focusing on a task-based system that allows new players to level up easily and hold their hands until they link to a new player community. From there, the community can take them under their wing, teach them the ropes, and show them what the game has to offer.\n\nThe 26 Best Mobile Games Available For iOS And Android\nSee More", "page_text_ko": "", "page_text_cn": "", "page_tags": ["Mobile", "iOS (iPhone/iPad)", "Android", "Ingress", "Ingress Prime"], "page_images": ["https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062956-ing_10-year-infographic_ig-1.jpeg", "https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062957-ing_10-year-infographic_ig-2.jpeg", "https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062958-ing_10-year-infographic_ig-3.jpeg", "https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062959-ing_10-year-infographic_ig-4.jpeg", "https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062960-ing_10-year-infographic_ig-5.jpeg", "https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062961-ing_10-year-infographic_ig-6.jpeg", "https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062962-ing_10-year-infographic_tw-1.jpeg", "https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062963-ing_10-year-infographic_tw-2.jpeg", "https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062964-ing_10-year-infographic_tw-3.jpeg", "https://www.gamespot.com/a/uploads/square_avatar/3/37852/4062965-ingress_10year_infographic_red2.png", "https://www.gamespot.com/a/uploads/screen_medium/1601/16018044/3932024-wtg.jpg", "https://www.gamespot.com/a/uploads/screen_medium/1601/16018044/3932021-3882969-amongus.jpg", "https://www.gamespot.com/a/uploads/screen_medium/1601/16018044/3932020-3882970-civilization_vi_keyart.jpg", "https://www.gamespot.com/a/uploads/screen_medium/1601/16018044/3932018-3882971-device6.jpg", "https://www.gamespot.com/a/uploads/screen_petite/1601/16018044/3932017-3882972-downwell.jpg", "https://www.gamespot.com/a/uploads/screen_petite/1601/16018044/3932016-3882973-flronceheader.jpg", "https://www.gamespot.com/a/uploads/screen_petite/1601/16018044/3932015-3882974-hitmango.jpg"], "page_videos": ""}